<a href="https://colab.research.google.com/github/v2047/Data-Analysis/blob/main/London_Housing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [54]:
import pandas as pd

In [55]:
hosuing = pd.read_csv("/content/5. London Housing Data.csv")
print(hosuing)

            date            area  ...  houses_sold no_of_crimes
0       1/1/1995  city of london  ...         17.0          NaN
1       2/1/1995  city of london  ...          7.0          NaN
2       3/1/1995  city of london  ...         14.0          NaN
3       4/1/1995  city of london  ...          7.0          NaN
4       5/1/1995  city of london  ...         10.0          NaN
...          ...             ...  ...          ...          ...
13544   9/1/2019         england  ...      64605.0          NaN
13545  10/1/2019         england  ...      68677.0          NaN
13546  11/1/2019         england  ...      67814.0          NaN
13547  12/1/2019         england  ...          NaN          NaN
13548   1/1/2020         england  ...          NaN          NaN

[13549 rows x 6 columns]

In [56]:
hosuing.shape

(13549, 6)

In [57]:
hosuing.head()

       date            area  ...  houses_sold no_of_crimes
0  1/1/1995  city of london  ...         17.0          NaN
1  2/1/1995  city of london  ...          7.0          NaN
2  3/1/1995  city of london  ...         14.0          NaN
3  4/1/1995  city of london  ...          7.0          NaN
4  5/1/1995  city of london  ...         10.0          NaN

[5 rows x 6 columns]

In [58]:
hosuing.tail()

            date     area  average_price       code  houses_sold  no_of_crimes
13544   9/1/2019  england         249942  E92000001      64605.0           NaN
13545  10/1/2019  england         249376  E92000001      68677.0           NaN
13546  11/1/2019  england         248515  E92000001      67814.0           NaN
13547  12/1/2019  england         250410  E92000001          NaN           NaN
13548   1/1/2020  england         247355  E92000001          NaN           NaN

In [59]:
hosuing.isnull()

        date   area  average_price   code  houses_sold  no_of_crimes
0      False  False          False  False        False          True
1      False  False          False  False        False          True
2      False  False          False  False        False          True
3      False  False          False  False        False          True
4      False  False          False  False        False          True
...      ...    ...            ...    ...          ...           ...
13544  False  False          False  False        False          True
13545  False  False          False  False        False          True
13546  False  False          False  False        False          True
13547  False  False          False  False         True          True
13548  False  False          False  False         True          True

[13549 rows x 6 columns]

In [60]:
hosuing.isnull().sum()

date                0
area                0
average_price       0
code                0
houses_sold        94
no_of_crimes     6110
dtype: int64

In [61]:
hosuing.count()

date             13549
area             13549
average_price    13549
code             13549
houses_sold      13455
no_of_crimes      7439
dtype: int64

In [62]:
hosuing.columns

Index(['date', 'area', 'average_price', 'code', 'houses_sold', 'no_of_crimes'], dtype='object')

In [63]:
# convert data type of "date" column date time format 
hosuing.date = pd.to_datetime(hosuing.date)
print(hosuing.date)

0       1995-01-01
1       1995-02-01
2       1995-03-01
3       1995-04-01
4       1995-05-01
           ...
13544   2019-09-01
13545   2019-10-01
13546   2019-11-01
13547   2019-12-01
13548   2020-01-01
Name: date, Length: 13549, dtype: datetime64[ns]

In [64]:
# Add a new columns "year" which contains only year.
hosuing["year"] = hosuing.date.dt.year
hosuing

            date            area  ...  no_of_crimes  year
0     1995-01-01  city of london  ...           NaN  1995
1     1995-02-01  city of london  ...           NaN  1995
2     1995-03-01  city of london  ...           NaN  1995
3     1995-04-01  city of london  ...           NaN  1995
4     1995-05-01  city of london  ...           NaN  1995
...          ...             ...  ...           ...   ...
13544 2019-09-01         england  ...           NaN  2019
13545 2019-10-01         england  ...           NaN  2019
13546 2019-11-01         england  ...           NaN  2019
13547 2019-12-01         england  ...           NaN  2019
13548 2020-01-01         england  ...           NaN  2020

[13549 rows x 7 columns]

In [65]:
# add a new column month  at 2 index 
hosuing.insert(2,"month",hosuing.date.dt.month)

In [66]:
hosuing

            date            area  month  ...  houses_sold no_of_crimes  year
0     1995-01-01  city of london      1  ...         17.0          NaN  1995
1     1995-02-01  city of london      2  ...          7.0          NaN  1995
2     1995-03-01  city of london      3  ...         14.0          NaN  1995
3     1995-04-01  city of london      4  ...          7.0          NaN  1995
4     1995-05-01  city of london      5  ...         10.0          NaN  1995
...          ...             ...    ...  ...          ...          ...   ...
13544 2019-09-01         england      9  ...      64605.0          NaN  2019
13545 2019-10-01         england     10  ...      68677.0          NaN  2019
13546 2019-11-01         england     11  ...      67814.0          NaN  2019
13547 2019-12-01         england     12  ...          NaN          NaN  2019
13548 2020-01-01         england      1  ...          NaN          NaN  2020

[13549 rows x 8 columns]

In [67]:
# Remove the columns yera and month
#hosuing.drop(["year"],axis = 1, inplace= True)

In [68]:
#hosuing.drop(["month"],axis = 1, inplace= True)

In [69]:
# we can remove in single line just write
#hosuing.drop(["month","year"],axis = 1, inplace= True)

In [70]:
hosuing

            date            area  month  ...  houses_sold no_of_crimes  year
0     1995-01-01  city of london      1  ...         17.0          NaN  1995
1     1995-02-01  city of london      2  ...          7.0          NaN  1995
2     1995-03-01  city of london      3  ...         14.0          NaN  1995
3     1995-04-01  city of london      4  ...          7.0          NaN  1995
4     1995-05-01  city of london      5  ...         10.0          NaN  1995
...          ...             ...    ...  ...          ...          ...   ...
13544 2019-09-01         england      9  ...      64605.0          NaN  2019
13545 2019-10-01         england     10  ...      68677.0          NaN  2019
13546 2019-11-01         england     11  ...      67814.0          NaN  2019
13547 2019-12-01         england     12  ...          NaN          NaN  2019
13548 2020-01-01         england      1  ...          NaN          NaN  2020

[13549 rows x 8 columns]

In [71]:
# show all the records where No of crimes are 0.
hosuing[hosuing["no_of_crimes"] == 0]

          date            area  month  ...  houses_sold no_of_crimes  year
72  2001-01-01  city of london      1  ...         24.0          0.0  2001
73  2001-02-01  city of london      2  ...         37.0          0.0  2001
74  2001-03-01  city of london      3  ...         44.0          0.0  2001
75  2001-04-01  city of london      4  ...         38.0          0.0  2001
76  2001-05-01  city of london      5  ...         30.0          0.0  2001
..         ...             ...    ...  ...          ...          ...   ...
178 2009-11-01  city of london     11  ...         11.0          0.0  2009
179 2009-12-01  city of london     12  ...         16.0          0.0  2009
180 2010-01-01  city of london      1  ...         20.0          0.0  2010
181 2010-02-01  city of london      2  ...          9.0          0.0  2010
182 2010-03-01  city of london      3  ...         15.0          0.0  2010

[104 rows x 8 columns]

In [72]:
len(hosuing[hosuing["no_of_crimes"] == 0])

104

In [73]:
# maximun and minimum "average_price" per year in england.
df = hosuing[hosuing.area == 'england' ]
df.groupby("year").average_price.max()

year
1995     53901
1996     55755
1997     61564
1998     65743
1999     75071
2000     84191
2001     95992
2002    119982
2003    138985
2004    160330
2005    167244
2006    182031
2007    194764
2008    191750
2009    174136
2010    180807
2011    177335
2012    180129
2013    188544
2014    203639
2015    219582
2016    231922
2017    242628
2018    248620
2019    250410
2020    247355
Name: average_price, dtype: int64

In [75]:
df.groupby("year").average_price.min()

3909794

In [76]:
df.groupby("year").average_price.max().sum()

4192410

In [77]:
df.groupby("year").average_price.min().sum()

3909794

In [78]:
hosuing.head(2)

        date            area  month  ...  houses_sold no_of_crimes  year
0 1995-01-01  city of london      1  ...         17.0          NaN  1995
1 1995-02-01  city of london      2  ...          7.0          NaN  1995

[2 rows x 8 columns]

In [79]:
hosuing.groupby("area").no_of_crimes.max()

area
barking and dagenham      2049.0
barnet                    2893.0
bexley                    1914.0
brent                     2937.0
bromley                   2637.0
camden                    4558.0
city of london              10.0
croydon                   3263.0
ealing                    3401.0
east midlands                NaN
east of england              NaN
enfield                   2798.0
england                      NaN
greenwich                 2853.0
hackney                   3466.0
hammersmith and fulham    2645.0
haringey                  3199.0
harrow                    1763.0
havering                  1956.0
hillingdon                2819.0
hounslow                  2817.0
inner london                 NaN
islington                 3384.0
kensington and chelsea    2778.0
kingston upon thames      1379.0
lambeth                   4701.0
lewisham                  2813.0
london                       NaN
merton                    1623.0
newham                    3668.0
north east                   NaN
north west                   NaN
outer london                 NaN
redbridge                 2560.0
richmond upon thames      1551.0
south east                   NaN
south west                   NaN
southwark                 3821.0
sutton                    1425.0
tower hamlets             3316.0
waltham forest            2941.0
wandsworth                3051.0
west midlands                NaN
westminster               7461.0
yorks and the humber         NaN
Name: no_of_crimes, dtype: float64

In [80]:
hosuing.groupby("area").no_of_crimes.max().sum()

94450.0

In [81]:
hosuing.groupby("area").no_of_crimes.max().sort_values(ascending = True)

area
city of london              10.0
kingston upon thames      1379.0
sutton                    1425.0
richmond upon thames      1551.0
merton                    1623.0
harrow                    1763.0
bexley                    1914.0
havering                  1956.0
barking and dagenham      2049.0
redbridge                 2560.0
bromley                   2637.0
hammersmith and fulham    2645.0
kensington and chelsea    2778.0
enfield                   2798.0
lewisham                  2813.0
hounslow                  2817.0
hillingdon                2819.0
greenwich                 2853.0
barnet                    2893.0
brent                     2937.0
waltham forest            2941.0
wandsworth                3051.0
haringey                  3199.0
croydon                   3263.0
tower hamlets             3316.0
islington                 3384.0
ealing                    3401.0
hackney                   3466.0
newham                    3668.0
southwark                 3821.0
camden                    4558.0
lambeth                   4701.0
westminster               7461.0
east midlands                NaN
east of england              NaN
england                      NaN
inner london                 NaN
london                       NaN
north east                   NaN
north west                   NaN
outer london                 NaN
south east                   NaN
south west                   NaN
west midlands                NaN
yorks and the humber         NaN
Name: no_of_crimes, dtype: float64

In [82]:
hosuing.groupby("area").no_of_crimes.min().sort_values(ascending = True)

area
city of london               0.0
kingston upon thames       692.0
richmond upon thames       700.0
sutton                     787.0
merton                     819.0
bexley                     860.0
harrow                     937.0
havering                  1130.0
barking and dagenham      1217.0
hammersmith and fulham    1323.0
kensington and chelsea    1347.0
bromley                   1441.0
hillingdon                1445.0
redbridge                 1487.0
greenwich                 1513.0
hounslow                  1529.0
haringey                  1536.0
waltham forest            1575.0
wandsworth                1582.0
enfield                   1635.0
tower hamlets             1646.0
lewisham                  1675.0
barnet                    1703.0
brent                     1850.0
hackney                   1870.0
ealing                    1871.0
islington                 1871.0
croydon                   2031.0
camden                    2079.0
newham                    2130.0
southwark                 2267.0
lambeth                   2381.0
westminster               3504.0
east midlands                NaN
east of england              NaN
england                      NaN
inner london                 NaN
london                       NaN
north east                   NaN
north west                   NaN
outer london                 NaN
south east                   NaN
south west                   NaN
west midlands                NaN
yorks and the humber         NaN
Name: no_of_crimes, dtype: float64

In [85]:
# show the total count of records of each area, where average price is less  than 100000
hosuing[hosuing.average_price < 100000].area.value_counts()

north east              112
north west              111
yorks and the humber    110
east midlands            96
west midlands            94
england                  87
barking and dagenham     85
south west               78
east of england          76
newham                   72
waltham forest           64
bexley                   64
lewisham                 62
havering                 60
south east               59
greenwich                59
croydon                  57
sutton                   54
enfield                  54
hackney                  53
redbridge                52
southwark                48
tower hamlets            47
outer london             46
hillingdon               44
hounslow                 41
lambeth                  41
brent                    40
london                   39
merton                   35
bromley                  33
haringey                 33
inner london             31
ealing                   31
kingston upon thames     30
harrow                   30
wandsworth               26
barnet                   25
islington                19
city of london           11
Name: area, dtype: int64